<a href="https://colab.research.google.com/github/emanuelmad/Data_Science_projects/blob/main/Criando_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## DataFrames a partir de Dicionários

Uma das estruturas básicas do Python é o Dicionário. É muito conveniente informarmos nossos dados em uma variável do tipo `dict`, pois sua conversão em *DataFrame* é muito simples e direta.

In [1]:
#importar pandas
import pandas as pd

In [2]:
#criar dicionário
dados = {
    'Nome': ['Emanuel', 'Anelisa', 'Marisa', 'Cesar'],
    'Idade': ['37', '34', '62', '65'],
    'Cidade': ['Olinda', 'Santa Maria', 'Santa Maria', 'Caxias do Sul'],
    'Compras': [True, True, False, False]

}

In [3]:
#criar dataframe
df = pd.DataFrame(dados)

In [4]:
#visualizar dataframe
display(df)

      Nome Idade         Cidade  Compras
0  Emanuel    37         Olinda     True
1  Anelisa    34    Santa Maria     True
2   Marisa    62    Santa Maria    False
3    Cesar    65  Caxias do Sul    False

In [5]:
#trocar id do usuário

id_usuario = [20, 30, 40, 50]

In [6]:
#Associar id a lista
df.index = id_usuario

In [8]:
#ver dataframe
display(df)

       Nome Idade         Cidade  Compras
20  Emanuel    37         Olinda     True
30  Anelisa    34    Santa Maria     True
40   Marisa    62    Santa Maria    False
50    Cesar    65  Caxias do Sul    False

## DataFrames a partir de Listas

Listas também são estruturas muito usadas em Python, e não é incomum termos que criar *DataFrames*  a partir destas.

Para organizar nossas várias listas de um modo que seja fácil sia conversão em *DataFrame*, vou usar a função *built-in* `zip()`.

In [10]:
#listas

dados = [[
  'Emanuel', 37, 'Olinda', 'True'],
         ['Anelisa', 34, 'Santa Maria', 'True'],
         ['Marisa', 62, 'Santa Maria', 'False'],
         ['Cesar', 65, 'Caxias do Sul', 'False']]

#DataFrame
df = pd.DataFrame(dados, columns=['Nome', 'Idade', 'Cidade', 'Compras'],
                  index= [20, 30, 40, 50])

df

       Nome  Idade         Cidade Compras
20  Emanuel     37         Olinda    True
30  Anelisa     34    Santa Maria    True
40   Marisa     62    Santa Maria   False
50    Cesar     65  Caxias do Sul   False

In [13]:
#selecionar pelo index
df.loc[20]

Nome       Emanuel
Idade           37
Cidade      Olinda
Compras       True
Name: 20, dtype: object

In [16]:
#criar nova coluna
df['Saldo'] = 0.0

df

       Nome  Idade         Cidade Compras  Saldo
20  Emanuel     37         Olinda    True    0.0
30  Anelisa     34    Santa Maria    True    0.0
40   Marisa     62    Santa Maria   False    0.0
50    Cesar     65  Caxias do Sul   False    0.0

## Modificar *index* e colunas

Às vezes, precisamos alterar o nome dos índices ou o *label* das colunas. Se você olhar na célula acima, veja que na esquerda do *DataFrame* o index de cada linha é representado por um número entre 0 e 3.

É possível alterar esse atributo da variável acessando diretamente assim:

In [17]:
df.index

Int64Index([20, 30, 40, 50], dtype='int64')

In [19]:
#Alterar o index do df
df.index = ['a', 'b', 'c', 'd']

df

      Nome  Idade         Cidade Compras  Saldo
a  Emanuel     37         Olinda    True    0.0
b  Anelisa     34    Santa Maria    True    0.0
c   Marisa     62    Santa Maria   False    0.0
d    Cesar     65  Caxias do Sul   False    0.0

Da mesma maneira, se eu precisar alterar o nome das colunas, posso alterar diretamente no atributo da variável:

In [22]:
#alterar labels das colunas
df.columns = ['Nome', 'Idade', 'Nascimento', 'Compras', 'Saldo disponível']

df

      Nome  Idade     Nascimento Compras  Saldo disponível
a  Emanuel     37         Olinda    True               0.0
b  Anelisa     34    Santa Maria    True               0.0
c   Marisa     62    Santa Maria   False               0.0
d    Cesar     65  Caxias do Sul   False               0.0